# running in wbpriarbiter/src/
read_verilog -formal fwb_slave.v
read_verilog -formal fwb_master.v
read_verilog -formal wbpriarbiter.v
prep -top wbpriarbiter

memory_nordff
async2sync
chformal -assume -early
chformal -live -fair -cover -remove
opt_clean
setundef -anyseq
opt -keepdc -fast
check
hierarchy -simcheck
write_ilang ../model/design.il
