# running in busyctr/src/
read -formal busyctr.v
prep -top busyctr
opt_merge -share_all

memory_nordff
async2sync
chformal -assume -early
chformal -live -fair -cover -remove
opt_clean
setundef -anyseq
opt -keepdc -fast
check
hierarchy -simcheck
write_ilang ../model/design.il
